# 1) ახსენი კომენტარებით რა არის debugging

# debugging-არის როცა ჩვენს კოდში არსებულ შეცდომებს ვასწორებთ.

# 2)ახსენი რაში გვჭირდება კომენტარები?

# კომენტარები გვჭირდება იმაში რომ ჩვენს დაწერილ კოდში ადამიანებს უკეთესად გავაგებინოთ რა წერია კოდში.

# 3)ახსენი რა არის case sensitive

# case sensitive-კომპიუტერი ყურადღებას აქცევს პატარა და დიდ სიტყვებს.

# 4)მომხმარებელს შემოატანინე მისი სახელი და შეინახე ის შესაბამის ცვლადში და დაბეჭდე ცვლადში შენახული მნიშვნელობა ტერმინალში

name = input("enter your name :")
print(name)

# 5) ახსენი რა არის input და output

# input-არის შემავალი რაღაცაში და output-არის რაღაცის გამომავალი.

# 6) ახსენი რა არის კონკატინაცია

# კონკატინაცია არის-სტრინგების ერთმანეთთან შეერთება.



