# 1)მომხმარებელს შემოატანინეთ რაღაც რიცხვი და შემდეგ შეამოწმეთ
#  თუ ეს რიცხვი არის ლუწი,დაბეჭდეთ "even", ხოლო თუ კენტია "odd"

number = int(input("enter the number"))
if number % 2:
    print("even")
else:
    print("odd")  

# 2)ცვლადში შეინახეთ თქვენი სახელი, მომხმარებელს
#  შემოატანინეთ მისი სახელი და თუ თქვენი სახელები ემთხვევა დაუპრინტეთ "Hello" სხვა შემთხვევაში "Bye"   

name = "George" 
name2 = input("enter his name")
if name==name2:
    print("Hello")
else:
    print("Bye")    

# 3)მომხმარებელს შემოატანინეთ რიცხვი და შეამოწმეთ, 
# თუ რიცხვი მეტია 90-ზე, დაბეჭდეთ "A", თუ რიცხვი ნაკლებია
#  90-ზე და მეტია 70-ზე, დაბეჭდეთ "B", თუ რიცხვი ნაკლებია 70-ზე 
# და მეტია 50-ზე, დაბეჭდეთ "C", სხვა შემთხვევაში დაბეჭდეთ "D"

number = int(input("enter the number"))
if number > 90:
    print("A")
elif number < 90 and number>70:
    print("B")
elif number < 70 and number > 50:
    print("C")    
else:
    print("D")    

#  4)while ციკლის მეშვეობით, შექმენით რიცხვების დიაპაზონი 1-დან 100 ჩათვლით,
#  შეამოწმეთ თუ რიცხვი არის ლუწი, დაბეჭდეთ ეს რიცხვი while
#  ციკლში და მიუწერეთ რომ ლუწია, თუ კენტია,
#  დაბეჭდეთ ეს რიცხვი და გვერძე მიუწერეთ რომ კენტია
#  / მაგ: (1 კენტიტა, 2 ლუწია, 3 კენტია, 4 ლუწია...) 

i=1
while i<101:
    if i % 2==0:
        print(i,"ლუწია")    
    else:
        print(i,"კენტია")    
        
 
