# 1)გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ


for i in range(12):
    print("George")
    print("Chakvetadze")

# 2)გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით

for i in range(1,21):
    print(i)

# 3)გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე

for i in range(20,0):
    print(i)

# 1)გამოიტანეთ რიცხვები 10-დან 15-მდე

i=10
while i<15:
    print(i) 

# 2)გამოიტანეთ რიცხვები 50-დან 0-მდე

i=50
while i>0:
    print(i)

# 3)კომენტარის სახით ახსენით რა არის counter ცვლადი და როდის ვიყენებთ While Loop-ს

#   counter ცვლადი არის ჩვეულებრივი ცვლადი რომელსაც ვიყენებთ იმისთვის რომ
#  დავთვალოთ რამდენჯერ შესრულდა რიცხვი ის იწყება 1-იდან და ყოველ ჯერზე იზრდება 1-ით 

  
 

 

    