# 2) შექმენით სია, რომლის მნიშვნელობებიც იქნება კომპიუტერის აქსესუარები.
#  სიიდან გამოიტანეთ იმ აქსესუარის ინდექსი, რომელსაც ყველაზე ხშირად იყენებთ.

# tecnic = ["computer","phone","TV","laptop"]
# print(tecnic[1])
# print(tecnic[3])

# 1) შექმენით სია, სადაც შეინახავთ საკვებ პროდუქტებს. სიას მიანიჭეთ შესაბამისი სახელი და გამოიტანეთ იგი ტერმინალში.

# fruits = ["Apple","peach","mandarin"]
# print(fruits)

# 3) შექმენით ისეთი სია, სადაც შეინახავთ ყველა ნასწავლ მონაცემთა
#  ტიპს ორ-ორჯერ, რომლებსაც მოათავსებთ სხვადასხვა ინდექსებზე.
#  ბოლოს ინდექსინგის საშუალებით გამოიტანეთ მხოლოდ Boolean მნიშვნელობები.

data = ["chakvetadze","giorgi",50,80,7.9,12.20,4>5,7<13]
print(data[6])
print(data[7])

# 4) მეოთხე დავალების მსგავსად, შექმენით ისეთი სია,თუმცა ამჯერად შეინახეთ ყველა ნასწავლი მონაცემთა ტიპი თითოჯერ.
#  ბოლოს უარყოფითი ინდექსსებით გამოიტანეთ მხოლოდ String ტიპის მნიშვნელობა .

data2 = ["nika",60,9.9,6<7]
print(data2[-4])








