# 1)შემოიტანეთ თქვენი ოჯახის წევრების ასაკი და დაუპრინტეთ თუ რამდენი წლისები
#  იქნებიან 25 წლის შემდეგ (გამოიყენეთ int ფუნქცია)

# ცვლადში სახელად mother_age-ში არის გადმოცემული სტრინგ მონაცემი ოღონდ აქ გვაქვს მიწერილი int ფუნქცია.
#  იმიტომ რომ სტრინგად სემოყვანილი მონაცემი გადავაქციოთ ინტეჯერად. 
# ცვლადში სახელად father_age-ში არის გამოყენებული სტრინგ მონაცემი
#  ოღონდ ამ სტრინგ მონაცემთან ერთად გვაქვს int ფუნქცია რომ გადაქციოს ინტეჯერად.
# ცვლადში სახელად my_age-ში არის გამოყენებული სტრინგ მონაცემი ოღონდ ამ სტრინგ 
# მონაცემთან ერთად გვაქვს გამოყენებული int ფუნქცია რომ გადავაქციოთ ინტეჯერად.

mother_age = int(input("enter your mothers_age :"))
fathers_age = int(input("enter your fathers_ age :"))
my_age = int(input("enter my_ age :"))

print(mother_age + 25)
print(fathers_age + 25)
print(my_age + 25)


# 2)მომხმარებელს შემოატანინეთ მისი სახელი და type ფუნქციის საშუალებით
#  გაიგეთ რა ტიპის მონცემია შემოტანილი მნიშვნელობა

name = input("enter his name")
print(type(name))

# ცვლადში სახელად name - ში input - ის დახმარებით შემოყვანილი არის სტრინგ მონაცემი,
#  და დაბლა print -ში გვიწერია type ფუნქცია რომ გავიგოთ რა მონაცემია შემოყვანილი ცვლადში სახელად name-ში.

# 4)კომენტარებით ახსენით რას აკეთებს int(),str() და float() ფუნქციები

# int ფუნქცია აქცევს ინტეჯერად. str ფუნქცია აქცევს სტრინგად. float ფუნქცია აქცევს float-ად.


