# 1)შექმენით სია რომელიც შედგება სახელებისგან, შემდეგ დაბეჭდეთ ტერმინალში ამ სიიდან მხოლოდ პირველი და ბოლო ელემენტი

# name = ["nika","giorgi","zura"]
# print(name[0])
# print(name[2])

# 2)შექმენით სია რომელიც შედგება ხილის სახელებისგან, დაბეჭდეთ ბოლო და ბოლოს წინა ელემენტი უარყოფითი ინდექსების საშუალებით

# fruits = ["peach","apple","bananas"]
# print(fruits[-2:])

# 3)მომხმარებელს შემოატანინეთ მისი სახელი და შეინახეთ ცვლადში შემდეგ გამოიტანეთ ამ სახელის პირველი და ბოლო ასო

# name = input("enter his name")
# print(name[0])
# print(name[3])

# 4)შექმენით სია რომელიც შედგება ადამიანის სახელებისგან გამოიტანე სიის მე2
#  ელემენტიდან მე5 ელემენტის ჩათვლით ყველა ელემენტი (გამოიყენეთ slicing)

name2 = ["anano","ana","nini","anka","tamuna","ekako"]
print(name2[1:6])