# 1) for ციკლის საშუალებით გამოიტანეთ 1 დან 20მდე ყველა რიცხვი

for i in range(1,20):
    print(i)

# 2) ახსენით რა არის sequencing, iteration და selection 
# sequencing-არის თანმიმდევრობა, iteration-არის ერთი და იგივე კოდის გამეორება და
#  selection-არის გადაწყვეტილება რომელიც სრულდება პირობაზე დაყრდნობით.

# 3) გამოიტანეთ for ციკლის საშუალებით  თქვენი სახელი 15ჯერ

for i in range(15):
    print("George")

# 4)გამოიტანეთ 0დან 10მდე ყველა ლუწი რიცხვი for ციკლის დახმარებით

for i in range(0,10) :
    print(i)
 
